Autodesk.Revit.DB.FamilySizeTableColumn.GetUnitTypeId
Gets the identifier of the unit quantifying values in the column.
Returns:
Identifier of the unit.
Since:
2014

Autodesk.Revit.DB.FamilySizeTableColumn.GetSpecTypeId
Gets the identifier of the spec describing values in the column.
Returns:
Identifier of the spec.
Since:
2014